artillery-scripts/io-test.yaml
# config:
#   target: "http://35.229.170.80"
#   phases:
#     - duration: 333
#       arrivalRate: 3
#       name: Warm up
#   payload:
#     path: "ratings_test_1k.csv"
#     fields :
#       - "content"
# scenarios:
#   # We define one scenario:
#   - name: "just post content"
#     flow:
#       - post:
#           url: "/post"
#           json:
#             content: "{{content}}"

# io-test.yaml 파일 (7분 12초 고도화된 형태)
config:
  target: "http://34.64.158.190"
  phases:
    - duration: 60
      arrivalRate: 3
      name: Warm up
    - duration: 120
      arrivalRate: 3
      rampTo: 50
      name: Ramp up load
    - duration: 9600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "ratings_test_50k.csv"
    fields:
      - "content"
scenarios:
  - name: "just post content"
    flow:
      - post:
          url: "/post"
          json:
            content:  "{{ content }}"
      # - think : 1
      # - get:
      #     url: "/posts"